Revit 2024 API
MEPAnalyticalModelData.GetMEPAnalyticalModelData Method
 Gets the MEP analytical model data of the specified element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static MEPAnalyticalModelData GetMEPAnalyticalModelData(
	Element pElement
)
Visual Basic
Public Shared Function GetMEPAnalyticalModelData ( _
	pElement As Element _
) As MEPAnalyticalModelData
Visual C++
public:
static MEPAnalyticalModelData^ GetMEPAnalyticalModelData(
	Element^ pElement
)
Parameters
pElement
Type: Autodesk.Revit.DB.Element
 The element that owns the MEP analytical model data.
Return Value
 The MEP analytical model data of this element, null if not available.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace